# %% ========== БЛОК 3. ДЕБАГІНГ (10 хв) ==========
# У кожному фрагменті є помилка. Знайдіть її та поясніть, як виправити.

print("# ---------- Завдання 3.1 ----------")
name = "Максим"
print(name)

# Питання: у чому помилка в цьому коді і як її виправити?


print("# ---------- Завдання 3.2 ----------")
age = int(input("Введіть вік: "))
can_vote = age >= 18
print(can_vote)

# Питання: у чому помилка в цьому коді і як її виправити?


print("# ---------- Завдання 3.3 ----------")
temperature = 36.6
is_normal = temperature == 36.6
print(is_normal)

# Питання: у чому помилка в цьому коді і як її виправити?
