# %% ========== БЛОК 3. ДЕБАГІНГ (10 хв) ==========
# У кожному фрагменті є помилка, яка спрацьовує не одразу очевидним
# чином. Знайдіть її та поясніть, як виправити.

print("# ---------- Завдання 3.1 ----------")
scores_input = "10,20,30"
scores = scores_input.split(",")
scores_int = []
for score in scores:
    scores_int.append(int(score))
total = sum(scores_int)
print(total)

# Питання: яка помилка виникне і чому? Що конкретно повертає split() і
# чому sum() не може підсумувати цей результат напряму?


print("# ---------- Завдання 3.2 ----------")
grades = [55, 82, 91, 67]
grades.sort()
print("Найвища оцінка:", grades[-1])

# Питання: чому цей код видасть помилку, а не очікуване число? Що саме
# повернув grades.sort() і чому звернення до [-1] тут неможливе?


print("# ---------- Завдання 3.3 ----------")
visits = {}
name = "Оля"
visits[name] = visits.get(name, 1)
visits[name] +=  1
print(visits)

# Питання: яка помилка виникне при спробі збільшити лічильник для
# ключа, якого ще немає у словнику? Як виправити цей код за допомогою
# .get() так, щоб перше відвідування теж рахувалось коректно?
