# %% ========== БЛОК 3. ДЕБАГІНГ (10 хв) ==========
# У кожному фрагменті є помилка. Знайдіть її та поясніть, як виправити.

print("# ---------- Завдання 3.1 ----------")
name = "Andriy"
name = name.upper()
print(name)

# Питання: у чому помилка в цьому коді і як її виправити?


print("# ---------- Завдання 3.2 ----------")
fruits = ["apple", "banana"]
fruits.extend(["cherry", "date"])
print(fruits)

# Питання: у чому помилка в цьому коді і як її виправити?


print("# ---------- Завдання 3.3 ----------")
numbers = [5, 3, 9, 1]
numbers.sort()
print(numbers)

# Питання: у чому помилка в цьому коді і як її виправити?
